<a href="https://colab.research.google.com/github/2303A51125/B3_PFDS_1125/blob/main/PSD_LAB_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
#DECTECT MISSING VALUES
import pandas as pd
import numpy as np

In [10]:
data ={
    'Name':['THRISHOOL','SUMANTH','RISHAAK','PAVAN'],
    'Age':[25,np.nan,30,28],
    'Marks':[85,90,np.nan,92]
}

In [9]:
df = pd.DataFrame(data)
print("original DataFrame")
print(df)
print("\n check for missing values")
print(df.isnull())

original DataFrame
        Name   Age  Marks
0  THRISHOOL  25.0   85.0
1    SUMANTH   NaN   90.0
2    RISHAAK  30.0    NaN
3      PAVAN  28.0   92.0

 check for missing values
    Name    Age  Marks
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [11]:
df_dropped = df.dropna()
print("After dropping rows with nan:")
print(df_dropped)

After dropping rows with nan:
        Name   Age  Marks
0  THRISHOOL  25.0   85.0
3      PAVAN  28.0   92.0

In [12]:
df_filled = df.fillna(0)
print("filled with 0:")
print(df_filled)

filled with 0:
        Name   Age  Marks
0  THRISHOOL  25.0   85.0
1    SUMANTH   0.0   90.0
2    RISHAAK  30.0    0.0
3      PAVAN  28.0   92.0

In [13]:
df['Age']=df['Age'].fillna(df['Age'].mean())
df['marks']=df['Marks'].fillna(df['Marks'].median())
print("\nfilled with mean")
print(df)

filled with mean
        Name        Age  Marks  marks
0  THRISHOOL  25.000000   85.0   85.0
1    SUMANTH  27.666667   90.0   90.0
2    RISHAAK  30.000000    NaN   90.0
3      PAVAN  28.000000   92.0   92.0

In [14]:
data ={
    'ID':[1,2,2,3,4,4],
    'Name':['THRISHOOL','SUMANTH','SUMANTH','RISHAAK','PAVAN','PAVAN'],
    'MARKS':[85,90,90,78,92,92]
}

In [15]:
df =pd.DataFrame(data)
print("original DataFrame with Duplicates")
print(df)

original DataFrame with Duplicates
   ID       Name  MARKS
0   1  THRISHOOL     85
1   2    SUMANTH     90
2   2    SUMANTH     90
3   3    RISHAAK     78
4   4      PAVAN     92
5   4      PAVAN     92

In [18]:
df_no_dup = df.drop_duplicates()
print("\nAfter removing duplicates")
print(df_no_dup)

After removing duplicates
   ID       Name  MARKS
0   1  THRISHOOL     85
1   2    SUMANTH     90
3   3    RISHAAK     78
4   4      PAVAN     92

In [20]:
data = {
    'ID':[1,2,3,4],
    'MARKS':['85','90','78','92']
}

In [21]:
df = pd.DataFrame(data)
print("original DataFrame")
print(df)

original DataFrame
   ID MARKS
0   1    85
1   2    90
2   3    78
3   4    92

In [22]:
df['ID'] = pd.to_numeric
df['MARKS'] = pd.to_numeric(df['MARKS'])
print("\n after conversion")
print(df.dtypes)

 after conversion
ID       object
MARKS     int64
dtype: object

In [23]:
df['MARKS']=df['MARKS'].apply(lambda x:x+5)
print("\n after adding bonus 5")
print(df)

 after adding bonus 5
                                        ID  MARKS
0  <function to_numeric at 0x7e5e1efb4860>     90
1  <function to_numeric at 0x7e5e1efb4860>     95
2  <function to_numeric at 0x7e5e1efb4860>     83
3  <function to_numeric at 0x7e5e1efb4860>     97

In [24]:
df['MARKS_NORMALIZED'] = (df['MARKS']-df['MARKS'].min())/(df['MARKS'].max()-df['MARKS'].min())
print("Normalization Marks")
print(df)

Normalization Marks
                                        ID  MARKS  MARKS_NORMALIZED
0  <function to_numeric at 0x7e5e1efb4860>     90          0.500000
1  <function to_numeric at 0x7e5e1efb4860>     95          0.857143
2  <function to_numeric at 0x7e5e1efb4860>     83          0.000000
3  <function to_numeric at 0x7e5e1efb4860>     97          1.000000